<?php
// 以下をfor文を使用して表示してください。
// ヒント: if〜elseifを使用

// ****1
// ***121
// **12321
// *1234321
// 123454321
// *1234321
// **12321
// ***121
// ****1
for($i = 1;$i <= 2; $i++){
    if($i == 1){
        for($a = 1; $a <= 5; $a++){
            for($b = 1;$b <= 5 - $a;$b++){
                echo "*";
            }
            for($c = 1;$c <= $a;$c++){
                echo $c;
            }
            for($d = $a - 1;$d >= 1;$d--){
                echo $d;
            }
            echo "\n";
        }
    } else if($i == 2){
        for($a = 1; $a <= 4; $a++){
            for($b = 1;$b <= $a;$b++){
                echo "*";
            }
            for($c = 1;$c <= 5 - $a;$c++){
                echo $c;
            }
            for($d = 4 - $a;$d >= 1;$d--){
                echo $d;
            }
            echo "\n";
        }
    } else {
        break;
    }
}