<?php
// 以下配列の中身をfor文を使用して表示してください。
// 横枠は「-」、縦線は「|」で表示すること
/**
 * 表示イメージ
 *  _________________________
 *  |_____|_c1|_c2|_c3|横合計|
 *  |___r1|_10|__5|_20|___35|
 *  |___r2|__7|__8|_12|___27|
 *  |___r3|_25|__9|130|__164|
 *  |縦合計|_42|_22|162|__226|
 *  ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 */

$arr = [
    'r1' => ['c1' => 10, 'c2' => 5, 'c3' => 20],
    'r2' => ['c1' => 7, 'c2' => 8, 'c3' => 12],
    'r3' => ['c1' => 25, 'c2' => 9, 'c3' => 130]
];

echo "-------------------------\n";
echo "|_____|_c1|_c2|_c3|横合計|\n";

$Allsum = 0;

for($a = 1; $a <= 3 ; $a++){
    $ra = 'r' . $a;
    echo "|___".$ra."|";
    $Wsum = 0;
    for($b = 1; $b <= 3 ; $b++){
        $ca = 'c' . $b;
        for($i = $arr[$ra][$ca] ; $i <= 99 ; $i = $i * 10){
            echo "_";
        }

        echo $arr[$ra][$ca]."|";
    
        $Wsum = $Wsum + $arr[$ra][$ca];
    }
    for($i = $Wsum ; $i <= 99 ; $i = $i * 10){
        echo "_";
    }
    echo "__".$Wsum."|";
    $Allsum = $Allsum + $Wsum;
    echo "\n";
}
echo "|縦合計|";
for($x = 1 ; $x <= 3 ; $x++){
    $Hsum = 0;
    $cb = 'c' . $x;
    for($y = 1 ; $y <= 3 ; $y++){
        $rb = 'r' . $y;
        $Hsum = $Hsum + $arr[$rb][$cb];
    }
    for($j = $Hsum ; $j <= 99 ; $j = $j * 10){
        echo "_";
    }
    echo $Hsum."|";
    $Allsum = $Allsum + $Hsum;
}
echo "__".$Allsum / 2 ."|";
echo "\n";
echo "-------------------------\n";

// 数字が3桁、2桁、1桁の場合にアンダーバーの数を場合分け